# Terraform environment at21
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
Acquiring state lock. This may take a few moments...
data.azurerm_servicebus_namespace.sb: Reading...
data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
data.azurerm_subnet.default: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
data.azurerm_subnet.postgres: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTQ1MTc3YTBhLWQyN2UtNDkwZi05ZjIzLWI0NzI2ZGU4Y2NjMTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTQ1MTc3YTBhLWQyN2UtNDkwZi05ZjIzLWI0NzI2ZGU4Y2NjMTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.Network/virtualNetworks/vnetauth001at21/subnets/postgres]
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.Network/virtualNetworks/vnetauth001at21/subnets/default]
data.azurerm_servicebus_namespace.sb: Read complete after 3s [id=/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at21]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_postgresql_flexible_server_database.database will be created
  + resource "azurerm_postgresql_flexible_server_database" "database" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "register"
      + server_id = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgregister001at21"
      + tags     = {
          + "environment" = "at21"
          + "instance"    = "001"
          + "name"        = "register"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "register001at21"
        }
    }

  # azurerm_role_assignment.key_vault_secret_reader will be created
  + resource "azurerm_role_assignment" "key_vault_secret_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.mass_transit_role will be created
  + resource "azurerm_role_assignment" "mass_transit_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Mass Transit"
      + scope                            = "/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at21"
      + skip_service_principal_aad_check = true
    }

  # azurerm_user_assigned_identity.mi will be created
  + resource "azurerm_user_assigned_identity" "mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "miregister001at21"
      + principal_id        = (known after apply)
      + resource_group_name = "rgregister001at21"
      + tenant_id           = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kvaltinnregister001at21"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + resource_group_name           = "rgregister001at21"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 30
      + tags                          = {
          + "environment" = "at21"
          + "instance"    = "001"
          + "name"        = "register"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "register001at21"
        }
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault.azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvaltinnregister001at21"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pekvaltinnregister001at21"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgregister001at21"
      + subnet_id                     = "/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.Network/virtualNetworks/vnetauth001at21/subnets/default"
      + tags                          = {
          + "environment" = "at21"
          + "instance"    = "001"
          + "name"        = "register"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "register001at21"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "kvaltinnregister001at21"
          + private_dns_zone_ids = []
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvaltinnregister001at21"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6eaed23e-df7f-4708-9c8e-a7f34deeadb4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgres_server" {
      + administrator_login           = (known after apply)
      + auto_grow_enabled             = true
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = "/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.Network/virtualNetworks/vnetauth001at21/subnets/postgres"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "psqlsrvaltinnregister001at21"
      + private_dns_zone_id           = "/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgauth001at21/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "rgregister001at21"
      + sku_name                      = "B_Standard_B2ms"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "environment" = "at21"
          + "instance"    = "001"
          + "name"        = "register"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "register001at21"
        }
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = false
          + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
        }

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.postgres_server.azurerm_postgresql_flexible_server_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + object_id           = (known after apply)
      + principal_name      = "mipsqlsrvadminregister001at21"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "rgregister001at21"
      + server_name         = "psqlsrvaltinnregister001at21"
      + tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
    }

  # module.postgres_server.azurerm_user_assigned_identity.postgres_server_admin will be created
  + resource "azurerm_user_assigned_identity" "postgres_server_admin" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "mipsqlsrvadminregister001at21"
      + principal_id        = (known after apply)
      + resource_group_name = "rgregister001at21"
      + tenant_id           = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/altinn-register` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at21/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at21_altinn.register.tfstate.tfplan`